OFsolvers/tutorial_cases/STR_kevin_inlet_hole/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         leastSquares;
    limited         cellLimited leastSquares 1;
}

divSchemes
{
    alphaScheme Gauss upwind; //Gauss vanLeer;
    advScheme   Gauss upwind; //bounded Gauss linearUpwind limited;

    default                         none;

    "div\(phi,alpha.*\)"            $alphaScheme;
    "div\(phir,alpha.*\)"           $alphaScheme;

    "div\(alphaRhoPhi.*,U.*\)"      $advScheme;
    "div\(phi.*,U.*\)"              $advScheme;

    "div\(alphaRhoPhi.*,Yi\)"       $advScheme;
    "div\(alphaRhoPhi.*,(h|e).*\)"  $advScheme;
    "div\(alphaPhi.*,f.*\)"         $advScheme;
    "div\(alphaRhoPhi.*,K.*\)"      $advScheme;
    "div\(alphaRhoPhi.*,Y.*\)"      $advScheme;
    "div\(alphaRhoPhi.*,\(p\|thermo:rho.*\)\)" $advScheme;
    "div\(alphaRhoPhi.*,(k|epsilon|omega).*\)"  $advScheme;
    "div\(phim,(k|epsilon)m\)"      $advScheme;

    "div\(\(\(\(alpha.*\*thermo:rho.*\)\*nuEff.*\)\*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

fluxRequired
{
    default         no;
}

wallDist
{
    method          meshWave;
    nRequired       yes;
}


// ************************************************************************* //
