OFsolvers/tutorial_cases/STR_kevin_inlet_hole/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 5;
    }

    bubbles
    {
        nCorr                   1;
        tolerance               1e-8;
        scale                   true;
        solveOnFinalIterOnly    true;
        sourceUpdateInterval    20;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-12;
        relTol          0.001;
        maxIter         20;
        minIter         2;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(e|h).*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-12;
       // relTol          0.001;
        minIter         1;
        maxIter         20;
    }

    "(k|epsilon|omega|Y).*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
        residualAlpha 1e-6;
    }

    "f.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    1;
    nCorrectors         6;
    nNonOrthogonalCorrectors 0;
    nEnergyCorrectors   1;

    faceMomentum        yes;

}

relaxationFactors
{
    fields
    {
        p_rgh 1;
        p_rghFinal 1.0;
    }

    equations
    {
        ".*"            0.99;
        "h\..*"         0.99;
    }
}
*/

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 5;
    }

    bubbles
    {
        nCorr                1;
        tolerance            1e-4;
        scale                true;
        solveOnFinalIterOnly true;
        sourceUpdateInterval 1;
    }

    "p_rgh.*"
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-12;
        relTol          0;
        maxIter 10;
    }

    "(k|omega).*"
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }

    "(e|h).*"
    {
        solver          PBiCGStab;
        smoother        GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
    }

    "f.*"
    {
        solver          PBiCGStab;
	smoother GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }

    "Yi.*"
    {
        solver          PBiCGStab;
        smoother GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
        residualAlpha   1e-8;
    }

    yPsi
    {
        solver          PCG;
        preconditioner  none;
        tolerance       1e-10;
        relTol          0;
    }
}


PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors          5;
    nOuterCorrectors    2;
    faceMomentum true;
    turbOnFinalIterationOnly false;
    outerCorrectorResidualControl
    {
        U
	{
                tolerance  1e-5;
                relTol      0;
        }
        p_rgh
        {
                tolerance  5e-4;
                relTol      0;
        }
     }
}
 
relaxationFactors
{
    fields
    {
        p_rgh      0.7;
        p_rghFinal   1;
    }
    equations
    {
        "U.gas|U.liquid|km|epsilonm|e.gas|e.liquid|Yi.gas|Yi.liquid"     0.7;
        "(U.gas|U.liquid|km|epsilonm|e.gas|e.liquid|Yi.gas|Yi.liquid)Final"   1;
    }
}

// ************************************************************************* //
