OFsolvers/tutorial_cases/STR_kevin_inlet_hole/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


X_hole  0.03175;
R_hole  0.002286; //0.18" ID for the sparger > R=0.002286

actions
(
    {
        name    inlet1;
        type    faceSet;
        action  new;
        source  cylinderToFace;
        sourceInfo
        {
        p1       ($X_hole -0.001 0);
        p2       ($X_hole  0.001 0);
        radius    $R_hole;
        }
    }
    {
        name    inlet2;
        type    faceSet;
        action  new;
        source  faceToFace;
        sourceInfo
        {
        set inlet1;
        }
    }
    {   
        name    faceBoundary;
        type    faceSet;
        action  new;
        source  boundaryToFace;
        sourceInfo
        {
        }
    }
    {
        name    inlet1;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {
        set faceBoundary;
        }
    }
    {
        name    inlet2;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {
        set inlet1;
        }
    }
);


// ************************************************************************* //
